The-Faulty/Argos/firmware/esp32c6/main/main.c
// Argos ESP32-C6 firmware. Owns the fast control loop:
//   * subscribes to /joint_command (sensor_msgs/JointState, 100 Hz from Pi)
//     and drives 12 PCA9685 channels with a watchdog that limps the servos
//     if commands stop coming in
//   * publishes /joint_states (sensor_msgs/JointState, 100 Hz) — echoes the
//     last command so RViz / downstream consumers see the MCU "feedback"
//   * publishes /imu/data_raw + /imu/mag (LSM9DS0, 100 Hz)
//   * publishes /gas (std_msgs/Float32, 10 Hz) — MQ-series ADC reading
//
// The Pi runs micro_ros_agent over UART (see ros2_ws/.../esp32_bridge.launch.py).

#include <math.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>
#include <unistd.h>

#include "esp_log.h"
#include "esp_system.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "esp_adc/adc_oneshot.h"

#include <rcl/error_handling.h>
#include <rcl/rcl.h>
#include <rclc/executor.h>
#include <rclc/rclc.h>
#include <rosidl_runtime_c/string_functions.h>
#include <rosidl_runtime_c/primitives_sequence_functions.h>
#include <sensor_msgs/msg/imu.h>
#include <sensor_msgs/msg/joint_state.h>
#include <sensor_msgs/msg/magnetic_field.h>
#include <std_msgs/msg/bool.h>
#include <std_msgs/msg/float32.h>
#include <uros_network_interfaces.h>

#ifdef CONFIG_MICRO_ROS_ESP_XRCE_DDS_MIDDLEWARE
#include <rmw_microros/rmw_microros.h>
#endif

#include "lsm9ds0.h"
#include "pca9685.h"
#include "driver/uart.h"
#include "esp32_serial_transport.h"

// ─── Pin / bus assignments ────────────────────────────────────────────────
//
// SCL/SDA values come from the original imu-branch firmware (GPIO22/23). The
// ESP32-C6 only exposes a subset of GPIOs as I2C-capable; verify against the
// schematic before flashing real hardware.
#define I2C_BUS         0
#define I2C_SCL_PIN     22
#define I2C_SDA_PIN     23
#define I2C_FREQ        I2C_FREQ_100K

#define PCA9685_I2C_PORT    I2C_NUM_0

// ─── Compile-time tunables (mirror Kconfig.projbuild) ─────────────────────

#ifndef CONFIG_ARGOS_PCA9685_ADDR
#define CONFIG_ARGOS_PCA9685_ADDR 0x00
#endif
#ifndef CONFIG_ARGOS_GAS_ADC_GPIO
#define CONFIG_ARGOS_GAS_ADC_GPIO 4
#endif
#ifndef CONFIG_ARGOS_JOINT_CMD_TIMEOUT_MS
#define CONFIG_ARGOS_JOINT_CMD_TIMEOUT_MS 250
#endif
#ifndef CONFIG_ARGOS_IMU_RATE_HZ
#define CONFIG_ARGOS_IMU_RATE_HZ 100
#endif
#ifndef CONFIG_ARGOS_GAS_RATE_HZ
#define CONFIG_ARGOS_GAS_RATE_HZ 10
#endif

// ─── Servo / joint constants (mirror ros2_ws/argos_control/Config.py) ─────

#define NUM_JOINTS 12

// Match web/leg_viz/server.py: 0..180° servo travel mapped to 370..2400 µs
// pulse, refreshed at 50 Hz. Both endpoints have to agree on these or the
// math drifts and bench calibration stops matching.
#define SERVO_PWM_FREQ_HZ   50
#define SERVO_PWM_MIN_US    370
#define SERVO_PWM_MAX_US    2400
#define SERVO_RANGE_DEG     180.0f
#define SERVO_CENTER_DEG    90.0f

#define DEG_PER_RAD (57.295779513f)
#define GRAVITY_MS2 9.80665f
#define DEG_TO_RAD  0.017453293f

// Per-joint calibration. Joint order MUST match JOINT_NAMES below
// (FR/FL/RR/RL × coxa/femur/tibia). Tune `direction` and `offset_deg` per
// joint after bench-testing the assembled robot — the Pi sends radians in
// "control space" (relative to neutral); this table is the only place that
// translates that into raw servo travel.
typedef struct {
    uint8_t channel;        // PCA9685 channel index 0..15
    int8_t  direction;      // +1 or -1, flips servo polarity per leg side
    float   offset_deg;     // mechanical zero offset added before clamping
    float   min_deg;        // SERVO_LIMITS_DEG[joint_type, 0]
    float   max_deg;        // SERVO_LIMITS_DEG[joint_type, 1]
} servo_cal_t;

static servo_cal_t s_servo_cal[NUM_JOINTS] = {
    // FR_coxa, FR_femur, FR_tibia
    { .channel = 0,  .direction = +1, .offset_deg = 0, .min_deg = 45, .max_deg = 135 },
    { .channel = 1,  .direction = +1, .offset_deg = 0, .min_deg = 50, .max_deg = 115 },
    { .channel = 2,  .direction = +1, .offset_deg = 0, .min_deg =  5, .max_deg = 180 },
    // FL_coxa, FL_femur, FL_tibia
    { .channel = 3,  .direction = +1, .offset_deg = 0, .min_deg = 45, .max_deg = 135 },
    { .channel = 4,  .direction = +1, .offset_deg = 0, .min_deg = 50, .max_deg = 115 },
    { .channel = 5,  .direction = +1, .offset_deg = 0, .min_deg =  5, .max_deg = 180 },
    // RR_coxa, RR_femur, RR_tibia — back-leg hip mirrored (commit f907ecc)
    { .channel = 6,  .direction = -1, .offset_deg = 0, .min_deg = 45, .max_deg = 135 },
    { .channel = 7,  .direction = +1, .offset_deg = 0, .min_deg = 50, .max_deg = 115 },
    { .channel = 8,  .direction = +1, .offset_deg = 0, .min_deg =  5, .max_deg = 180 },
    // RL_coxa, RL_femur, RL_tibia — back-leg hip mirrored
    { .channel = 9,  .direction = -1, .offset_deg = 0, .min_deg = 45, .max_deg = 135 },
    { .channel = 10, .direction = +1, .offset_deg = 0, .min_deg = 50, .max_deg = 115 },
    { .channel = 11, .direction = +1, .offset_deg = 0, .min_deg =  5, .max_deg = 180 },
};

static const char *const JOINT_NAMES[NUM_JOINTS] = {
    "FR_coxa_joint", "FR_femur_joint", "FR_tibia_joint",
    "FL_coxa_joint", "FL_femur_joint", "FL_tibia_joint",
    "RR_coxa_joint", "RR_femur_joint", "RR_tibia_joint",
    "RL_coxa_joint", "RL_femur_joint", "RL_tibia_joint",
};

// ─── micro-ROS plumbing ───────────────────────────────────────────────────

#define RCCHECK(fn) {                                                      \
    rcl_ret_t _rc = (fn);                                                  \
    if (_rc != RCL_RET_OK) {                                               \
        printf("RCCHECK fail line %d rc=%d\n", __LINE__, (int)_rc);        \
        vTaskDelete(NULL);                                                 \
    }                                                                      \
}
#define RCSOFTCHECK(fn) {                                                  \
    rcl_ret_t _rc = (fn);                                                  \
    if (_rc != RCL_RET_OK) {                                               \
        printf("RCSOFT fail line %d rc=%d\n", __LINE__, (int)_rc);         \
    }                                                                      \
}

static rcl_publisher_t imu_pub;
static rcl_publisher_t mag_pub;
static rcl_publisher_t joint_states_pub;
static rcl_publisher_t gas_pub;
static rcl_subscription_t joint_cmd_sub;
static rcl_subscription_t s_release_sub;
static rcl_subscription_t s_pwm_rate_sub;

static sensor_msgs__msg__Imu              imu_msg;
static sensor_msgs__msg__MagneticField    mag_msg;
static sensor_msgs__msg__JointState       joint_states_msg;
static sensor_msgs__msg__JointState       joint_cmd_msg;
static std_msgs__msg__Float32             gas_msg;
static std_msgs__msg__Bool                s_release_msg;
static std_msgs__msg__Float32             s_pwm_rate_msg;

// Bounds for /dashboard/servo_update_rate_hz — mirrors
// dashboard/shared/robot-config.js SERVO_UPDATE_RATE_BOUNDS_HZ.
#define ARGOS_SERVO_UPDATE_RATE_MIN_HZ 40
#define ARGOS_SERVO_UPDATE_RATE_MAX_HZ 200

static lsm9ds0_am_sensor_t *sensor_am;
static lsm9ds0_g_sensor_t  *sensor_g;

// Latest commanded joint positions (radians). Updated by the subscriber,
// re-published in /joint_states, and consumed by the watchdog. The watchdog
// stamp is bumped on every valid /joint_command message; if it goes stale,
// the servos are released so the robot sags rather than freezing.
static float    s_latest_cmd_rad[NUM_JOINTS] = {0};
static int64_t  s_last_cmd_us = 0;
static bool     s_watchdog_tripped = true;  // start tripped — wait for first cmd

// Gas sensor — single-pole IIR low-pass to smooth 60 Hz pickup before publish
static adc_oneshot_unit_handle_t s_adc_handle = NULL;
static adc_cali_handle_t         s_adc_cali = NULL;
static adc_channel_t             s_adc_channel;
static float                     s_gas_filtered_mv = 0.0f;

// Latched "released" state. Set true when the dashboard publishes
// /release_servos=true; cleared only by publishing /release_servos=false.
// While latched, control_timer_callback skips apply_latest_to_servos() even
// if /joint_command is still streaming — otherwise a 100 Hz Pi feed would
// silently re-energize the servos a tick after the user hit "release".
static bool                      s_release_latched = false;

// ─── Helpers ──────────────────────────────────────────────────────────────

