The-Faulty/Argos/firmware/esp32c6/main/main.c
static int find_joint_index(const char *name) {
    if (!name) return -1;
    for (int i = 0; i < NUM_JOINTS; ++i) {
        if (strcmp(JOINT_NAMES[i], name) == 0) return i;
    }
    return -1;
}

static uint16_t joint_rad_to_pulse_us(int joint_index, float angle_rad) {
    const servo_cal_t *cal = &s_servo_cal[joint_index];
    float deg = SERVO_CENTER_DEG
              + (float)cal->direction * (angle_rad * DEG_PER_RAD)
              + cal->offset_deg;

    // Final clamp: even if the Pi-side safety node misbehaves, the servo
    // never gets driven outside its bench-tested mechanical envelope.
    if (deg < cal->min_deg) deg = cal->min_deg;
    if (deg > cal->max_deg) deg = cal->max_deg;

    float frac = deg / SERVO_RANGE_DEG;
    uint16_t us = (uint16_t)(SERVO_PWM_MIN_US
                  + frac * (SERVO_PWM_MAX_US - SERVO_PWM_MIN_US));
    return us;
}

static void apply_latest_to_servos(void) {
    for (int i = 0; i < NUM_JOINTS; ++i) {
        uint16_t us = joint_rad_to_pulse_us(i, s_latest_cmd_rad[i]);
        pca9685_set_pulse_us(us, s_servo_cal[i].channel);
    }
}

// ─── Subscriber callback ──────────────────────────────────────────────────

static void joint_cmd_callback(const void *msgin) {
    const sensor_msgs__msg__JointState *m = (const sensor_msgs__msg__JointState *)msgin;
    if (!m || m->position.size == 0) return;

    bool name_ordered = (m->name.size == m->position.size);

    // Re-order by name so the Pi can publish in any order. If names are
    // missing we trust positional order — matches the Pi's
    // positions_from_joint_state() fallback.
    if (name_ordered) {
        for (size_t i = 0; i < m->position.size; ++i) {
            int j = find_joint_index(m->name.data[i].data);
            if (j < 0) continue;
            s_latest_cmd_rad[j] = (float)m->position.data[i];
        }
    } else {
        size_t n = m->position.size < NUM_JOINTS ? m->position.size : NUM_JOINTS;
        for (size_t i = 0; i < n; ++i) {
            s_latest_cmd_rad[i] = (float)m->position.data[i];
        }
    }

    s_last_cmd_us = esp_timer_get_time();
    if (s_watchdog_tripped) {
        ESP_LOGI("CMD", "joint command stream resumed");
        s_watchdog_tripped = false;
    }
}

// /release_servos — dashboard-driven emergency limp. `true` releases the
// PCA9685 channels immediately and latches that state; the user must send
// `false` on the same topic to clear the latch (so an in-flight /joint_command
// burst can't silently re-energize the robot).
static void release_callback(const void *msgin) {
    const std_msgs__msg__Bool *m = (const std_msgs__msg__Bool *)msgin;
    if (!m) return;

    if (m->data) {
        if (!s_release_latched) {
            ESP_LOGW("REL", "release_servos=true — servos going limp");
        }
        pca9685_release_all();
        s_release_latched = true;
        s_watchdog_tripped = true;  // treat as "waiting for a fresh command"
    } else {
        if (s_release_latched) {
            ESP_LOGI("REL", "release_servos=false — latch cleared");
        }
        s_release_latched = false;
    }
}

// /dashboard/servo_update_rate_hz — live PCA9685 PWM-frequency retune.
// The dashboard Settings panel publishes this when the user drags the slider.
// We clamp to a safe window here too: firmware is the last line of defense
// against a bogus Pi-side value bricking the servos.
static void pwm_rate_callback(const void *msgin) {
    const std_msgs__msg__Float32 *m = (const std_msgs__msg__Float32 *)msgin;
    if (!m) return;
    float hz = m->data;
    if (hz < ARGOS_SERVO_UPDATE_RATE_MIN_HZ) hz = ARGOS_SERVO_UPDATE_RATE_MIN_HZ;
    if (hz > ARGOS_SERVO_UPDATE_RATE_MAX_HZ) hz = ARGOS_SERVO_UPDATE_RATE_MAX_HZ;
    uint16_t freq_hz = (uint16_t)(hz + 0.5f);
    esp_err_t err = pca9685_set_pwm_freq(freq_hz);
    if (err != ESP_OK) {
        ESP_LOGW("PWM", "set_pwm_freq(%u) failed: %s", (unsigned)freq_hz,
                 esp_err_to_name(err));
    } else {
        ESP_LOGI("PWM", "servo update rate now %u Hz (from dashboard)",
                 (unsigned)freq_hz);
    }
}

// ─── Timer callbacks ──────────────────────────────────────────────────────

static void stamp_header_now(builtin_interfaces__msg__Time *stamp) {
    int64_t now_ns = rmw_uros_epoch_nanos();
    stamp->sec     = (int32_t)(now_ns / 1000000000LL);
    stamp->nanosec = (uint32_t)(now_ns % 1000000000LL);
}

static void control_timer_callback(rcl_timer_t *timer, int64_t last_call_time) {
    RCLC_UNUSED(last_call_time);
    if (!timer) return;

    int64_t now_us = esp_timer_get_time();
    int64_t age_ms = (now_us - s_last_cmd_us) / 1000;

    // Watchdog: if the Pi has stopped talking, release every channel so the
    // robot sags rather than holding the last commanded pose forever. The
    // joint_states echo below keeps publishing the last command — that's
    // intentional, downstream consumers can see "MCU still alive, but
    // commands have stopped".
    if (s_release_latched) {
        // Dashboard asked for limp servos and has not cleared the latch. Keep
        // the channels zeroed even while /joint_command keeps streaming — the
        // release primitive already ran in release_callback(); no need to
        // re-issue it every tick.
    } else if (age_ms > CONFIG_ARGOS_JOINT_CMD_TIMEOUT_MS) {
        if (!s_watchdog_tripped) {
            ESP_LOGW("WD", "joint command stale (%lld ms) — releasing servos", age_ms);
            pca9685_release_all();
            s_watchdog_tripped = true;
        }
    } else {
        apply_latest_to_servos();
    }

    // ── IMU read + publish ───────────────────────────────────────────────
    lsm9ds0_float_a_data_t a = {0};
    lsm9ds0_float_g_data_t g = {0};
    lsm9ds0_float_m_data_t m = {0};

    if (lsm9ds0_new_a_data(sensor_am) && lsm9ds0_get_float_a_data(sensor_am, &a)) {
        imu_msg.linear_acceleration.x = a.ax * GRAVITY_MS2;
        imu_msg.linear_acceleration.y = a.ay * GRAVITY_MS2;
        imu_msg.linear_acceleration.z = a.az * GRAVITY_MS2;
    }
    if (lsm9ds0_new_g_data(sensor_g) && lsm9ds0_get_float_g_data(sensor_g, &g)) {
        imu_msg.angular_velocity.x = g.x * DEG_TO_RAD;
        imu_msg.angular_velocity.y = g.y * DEG_TO_RAD;
        imu_msg.angular_velocity.z = g.z * DEG_TO_RAD;
    }
    if (lsm9ds0_new_m_data(sensor_am) && lsm9ds0_get_float_m_data(sensor_am, &m)) {
        mag_msg.magnetic_field.x = m.mx * 1e-4;
        mag_msg.magnetic_field.y = m.my * 1e-4;
        mag_msg.magnetic_field.z = m.mz * 1e-4;
    }
    imu_msg.orientation_covariance[0] = -1.0;  // signal "no orientation estimate"

    stamp_header_now(&imu_msg.header.stamp);
    stamp_header_now(&mag_msg.header.stamp);
    RCSOFTCHECK(rcl_publish(&imu_pub, &imu_msg, NULL));
    RCSOFTCHECK(rcl_publish(&mag_pub, &mag_msg, NULL));

