The-Faulty/Argos/firmware/esp32c6/main/main.c
    // ── /joint_states echo ──────────────────────────────────────────────
    // Publishes the last commanded angles back, so the Pi can stop relying
    // on its preview publisher (see docs/pi_hardware_contract.md:88-89).
    stamp_header_now(&joint_states_msg.header.stamp);
    for (int i = 0; i < NUM_JOINTS; ++i) {
        joint_states_msg.position.data[i] = s_latest_cmd_rad[i];
    }
    RCSOFTCHECK(rcl_publish(&joint_states_pub, &joint_states_msg, NULL));
}

static void gas_timer_callback(rcl_timer_t *timer, int64_t last_call_time) {
    RCLC_UNUSED(last_call_time);
    if (!timer || !s_adc_handle) return;

    int raw = 0;
    if (adc_oneshot_read(s_adc_handle, s_adc_channel, &raw) != ESP_OK) return;

    int mv = 0;
    if (s_adc_cali && adc_cali_raw_to_voltage(s_adc_cali, raw, &mv) == ESP_OK) {
        // calibrated reading available — use mV
    } else {
        // Fallback if cal scheme isn't supported: fake a linear mapping over
        // 0..3300 mV across the 12-bit raw range.
        mv = (raw * 3300) / 4095;
    }

    // Single-pole IIR low-pass — alpha=0.2 trades off settling (~5 samples ≈
    // 0.5 s at 10 Hz) against 60 Hz pickup rejection. Tune if needed.
    s_gas_filtered_mv = 0.8f * s_gas_filtered_mv + 0.2f * (float)mv;

    gas_msg.data = s_gas_filtered_mv;
    RCSOFTCHECK(rcl_publish(&gas_pub, &gas_msg, NULL));
}

// ─── Init helpers ─────────────────────────────────────────────────────────

static void init_imu(void) {
    i2c_init(I2C_BUS, I2C_SCL_PIN, I2C_SDA_PIN, I2C_FREQ);

    sensor_am = lsm9ds0_init_am_sensor(I2C_BUS, LSM9DS0_I2C_AM_ADDRESS_2, 0);
    sensor_g  = lsm9ds0_init_g_sensor(I2C_BUS, LSM9DS0_I2C_G_ADDRESS_2, 0);
    if (!sensor_am || !sensor_g) {
        ESP_LOGE("IMU", "LSM9DS0 init failed — check wiring/I2C address");
        return;
    }
    ESP_LOGI("IMU", "LSM9DS0 initialized");

    lsm9ds0_set_a_scale(sensor_am, lsm9ds0_a_scale_2_g);
    lsm9ds0_set_m_scale(sensor_am, lsm9ds0_m_scale_4_Gs);
    lsm9ds0_set_g_scale(sensor_g,  lsm9ds0_g_scale_245_dps);

    // Bumped to 100 Hz accel ODR to actually feed the new control loop rate.
    lsm9ds0_set_a_mode(sensor_am, lsm9ds0_a_odr_100, lsm9ds0_a_aaf_bw_773, true, true, true);
    lsm9ds0_set_m_mode(sensor_am, lsm9ds0_m_odr_100, lsm9ds0_m_low_res, lsm9ds0_m_continuous);
    lsm9ds0_set_g_mode(sensor_g,  lsm9ds0_g_odr_190, 3, true, true, true);
}

// PCA9685 shares I2C_BUS with the IMU. The esp8266_wrapper i2c_init above
// configures the bus; here we just re-use the standard ESP-IDF driver port,
// which is wired to the same pins via the wrapper's call to i2c_param_config.
static void init_servos(void) {
    esp_err_t err = pca9685_init(PCA9685_I2C_PORT,
                                 CONFIG_ARGOS_PCA9685_ADDR,
                                 SERVO_PWM_FREQ_HZ);
    if (err != ESP_OK) {
        ESP_LOGE("SERVO", "PCA9685 init failed: %s", esp_err_to_name(err));
        return;
    }
    pca9685_release_all();  // start limp; first /joint_command brings them up
}

static void init_gas_adc(void) {
    // Discover unit + channel from the configured GPIO so the same code works
    // on ESP32 (where GPIO4 is ADC2_CH0) and on ESP32-C6 (where GPIO0..6 are
    // ADC1_CH0..6). On plain ESP32, ADC2 is muxed with WiFi — but Argos uses
    // UART transport, so ADC2 is fine to use here.
    adc_unit_t    discovered_unit;
    adc_channel_t discovered_channel;
    if (adc_oneshot_io_to_channel(CONFIG_ARGOS_GAS_ADC_GPIO,
                                  &discovered_unit,
                                  &discovered_channel) != ESP_OK) {
        ESP_LOGE("GAS", "GPIO %d is not an ADC pin", CONFIG_ARGOS_GAS_ADC_GPIO);
        return;
    }
    s_adc_channel = discovered_channel;

    adc_oneshot_unit_init_cfg_t init_cfg = { .unit_id = discovered_unit };
    if (adc_oneshot_new_unit(&init_cfg, &s_adc_handle) != ESP_OK) {
        ESP_LOGE("GAS", "adc_oneshot_new_unit failed");
        return;
    }

    adc_oneshot_chan_cfg_t cfg = {
        .atten    = ADC_ATTEN_DB_12,    // ~0..3.1 V usable (DB_11 is deprecated)
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    adc_oneshot_config_channel(s_adc_handle, s_adc_channel, &cfg);

    // Plain ESP32 (Xtensa) only supports line-fitting calibration; the
    // curve-fitting scheme is for RISC-V parts (C3/C6/H2/etc.).
    adc_cali_line_fitting_config_t cali_cfg = {
        .unit_id  = discovered_unit,
        .atten    = ADC_ATTEN_DB_12,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    if (adc_cali_create_scheme_line_fitting(&cali_cfg, &s_adc_cali) != ESP_OK) {
        ESP_LOGW("GAS", "ADC calibration unavailable, using linear fallback");
        s_adc_cali = NULL;
    }
}

static bool init_joint_state_msgs(void) {
    // /joint_states echo — preallocate name + position sequences so the
    // 100 Hz timer callback doesn't allocate.
    if (!rosidl_runtime_c__String__init(&joint_states_msg.header.frame_id)) return false;
    rosidl_runtime_c__String__assign(&joint_states_msg.header.frame_id, "base_link");

    if (!rosidl_runtime_c__String__Sequence__init(&joint_states_msg.name, NUM_JOINTS)) return false;
    if (!rosidl_runtime_c__double__Sequence__init(&joint_states_msg.position, NUM_JOINTS)) return false;

    for (int i = 0; i < NUM_JOINTS; ++i) {
        rosidl_runtime_c__String__assign(&joint_states_msg.name.data[i], JOINT_NAMES[i]);
        joint_states_msg.position.data[i] = 0.0;
    }

    // /joint_command subscriber — preallocate up to NUM_JOINTS entries
    if (!rosidl_runtime_c__String__Sequence__init(&joint_cmd_msg.name, NUM_JOINTS)) return false;
    if (!rosidl_runtime_c__double__Sequence__init(&joint_cmd_msg.position, NUM_JOINTS)) return false;
    for (int i = 0; i < NUM_JOINTS; ++i) {
        // Pre-size each name string buffer so the rclc_executor can fill it
        // without dynamic allocation in the rt path.
        rosidl_runtime_c__String__init(&joint_cmd_msg.name.data[i]);
        rosidl_runtime_c__String__assign(&joint_cmd_msg.name.data[i], "");
    }

