The-Faulty/Argos/firmware/esp32c6/main/main.c
    return true;
}

// ─── micro-ROS task ───────────────────────────────────────────────────────

static void micro_ros_task(void *arg) {
    init_imu();
    init_servos();
    init_gas_adc();

    rcl_allocator_t allocator = rcl_get_default_allocator();
    rclc_support_t  support;
    rcl_init_options_t init_options = rcl_get_zero_initialized_init_options();
    RCCHECK(rcl_init_options_init(&init_options, allocator));

    // Transport selection happens at component-config time (UART for the
    // HUZZAH32 build via CONFIG_RMW_UXRCE_TRANSPORT_CUSTOM=y); no runtime
    // address setup is needed. The earlier WiFi/UDP setup block was removed
    // when we moved off the C6's ESP-NETIF transport.

    rcl_ret_t rc = rclc_support_init_with_options(&support, 0, NULL, &init_options, &allocator);
    if (rc != RCL_RET_OK) {
        ESP_LOGE("UROS", "support init failed rc=%d", (int)rc);
        vTaskDelete(NULL);
        return;
    }
    rmw_uros_sync_session(1000);

    rcl_node_t node;
    RCCHECK(rclc_node_init_default(&node, "argos_esp32c6", "", &support));

    // ── IMU + mag ────────────────────────────────────────────────────────
    rosidl_runtime_c__String__init(&imu_msg.header.frame_id);
    rosidl_runtime_c__String__assign(&imu_msg.header.frame_id, "imu_link");
    imu_msg.orientation_covariance[0] = -1.0;
    rosidl_runtime_c__String__init(&mag_msg.header.frame_id);
    rosidl_runtime_c__String__assign(&mag_msg.header.frame_id, "imu_link");

    RCCHECK(rclc_publisher_init_default(
        &imu_pub, &node,
        ROSIDL_GET_MSG_TYPE_SUPPORT(sensor_msgs, msg, Imu),
        "/imu/data_raw"));
    RCCHECK(rclc_publisher_init_default(
        &mag_pub, &node,
        ROSIDL_GET_MSG_TYPE_SUPPORT(sensor_msgs, msg, MagneticField),
        "/imu/mag"));

    // ── /joint_states + /joint_command ──────────────────────────────────
    if (!init_joint_state_msgs()) {
        ESP_LOGE("UROS", "joint state msg init failed");
        vTaskDelete(NULL);
        return;
    }
    RCCHECK(rclc_publisher_init_default(
        &joint_states_pub, &node,
        ROSIDL_GET_MSG_TYPE_SUPPORT(sensor_msgs, msg, JointState),
        "/joint_states"));
    RCCHECK(rclc_subscription_init_default(
        &joint_cmd_sub, &node,
        ROSIDL_GET_MSG_TYPE_SUPPORT(sensor_msgs, msg, JointState),
        "/joint_command"));

    // ── /gas ────────────────────────────────────────────────────────────
    RCCHECK(rclc_publisher_init_default(
        &gas_pub, &node,
        ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, Float32),
        "/gas"));

    // ── /release_servos ─────────────────────────────────────────────────
    RCCHECK(rclc_subscription_init_default(
        &s_release_sub, &node,
        ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, Bool),
        "/release_servos"));

    // ── /dashboard/servo_update_rate_hz ─────────────────────────────────
    // Live PCA9685 PWM-rate retune. Subscribed by pwm_rate_callback above,
    // which clamps to [ARGOS_SERVO_UPDATE_RATE_MIN_HZ, _MAX_HZ] before
    // handing off to pca9685_set_pwm_freq.
    RCCHECK(rclc_subscription_init_default(
        &s_pwm_rate_sub, &node,
        ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, Float32),
        "/dashboard/servo_update_rate_hz"));

    // ── timers ──────────────────────────────────────────────────────────
    rcl_timer_t control_timer, gas_timer;
    const uint32_t control_period_ms = 1000U / CONFIG_ARGOS_IMU_RATE_HZ;
    const uint32_t gas_period_ms     = 1000U / CONFIG_ARGOS_GAS_RATE_HZ;
    RCCHECK(rclc_timer_init_default(&control_timer, &support,
                                    RCL_MS_TO_NS(control_period_ms),
                                    control_timer_callback));
    RCCHECK(rclc_timer_init_default(&gas_timer, &support,
                                    RCL_MS_TO_NS(gas_period_ms),
                                    gas_timer_callback));

    // 3 subs + 2 timers = 5 handles
    rclc_executor_t executor;
    RCCHECK(rclc_executor_init(&executor, &support.context, 5, &allocator));
    RCCHECK(rclc_executor_add_subscription(&executor, &joint_cmd_sub, &joint_cmd_msg,
                                           &joint_cmd_callback, ON_NEW_DATA));
    RCCHECK(rclc_executor_add_subscription(&executor, &s_release_sub, &s_release_msg,
                                           &release_callback, ON_NEW_DATA));
    RCCHECK(rclc_executor_add_subscription(&executor, &s_pwm_rate_sub, &s_pwm_rate_msg,
                                           &pwm_rate_callback, ON_NEW_DATA));
    RCCHECK(rclc_executor_add_timer(&executor, &control_timer));
    RCCHECK(rclc_executor_add_timer(&executor, &gas_timer));

    while (1) {
        rclc_executor_spin_some(&executor, RCL_MS_TO_NS(10));
        usleep(1000);
    }

    // The while(1) above never exits, so cleanup is unreachable. We used
    // to call rcl_*_fini here for tidiness, but GCC's -Wunused-result on
    // those functions can't be silenced with (void) casts under -Werror.
    vTaskDelete(NULL);
}

// UART port handed to the micro-ROS custom transport. UART_NUM_0 is the
// HUZZAH32's USB-serial bridge (CP2104), which is exactly the port the Pi
// sees as /dev/ttyESP32. The address of this static must outlive the call,
// so it lives at file scope rather than on the stack.
static size_t s_uart_port = UART_NUM_0;

void app_main(void) {
#if defined(CONFIG_MICRO_ROS_ESP_NETIF_WLAN) || defined(CONFIG_MICRO_ROS_ESP_NETIF_ENET)
    ESP_ERROR_CHECK(uros_network_interface_initialize());
#endif

#if defined(RMW_UXRCE_TRANSPORT_CUSTOM)
    // Wire the rmw_microxrcedds custom-transport hooks to the UART driver
    // implementation in esp32_serial_transport.c. Must happen before
    // rclc_support_init in micro_ros_task — that's where the rmw layer
    // calls esp32_serial_open via the framing layer.
    rmw_uros_set_custom_transport(
        true,
        (void *) &s_uart_port,
        esp32_serial_open,
        esp32_serial_close,
        esp32_serial_write,
        esp32_serial_read);
#else
#error micro-ROS transports misconfigured: rebuild libmicroros with RMW_UXRCE_TRANSPORT=custom
#endif

    xTaskCreate(micro_ros_task,
                "uros_task",
                CONFIG_MICRO_ROS_APP_STACK,
                NULL,
                CONFIG_MICRO_ROS_APP_TASK_PRIO,
                NULL);
}
